[
    {
        "text": "{\"input\": \"I feel depressed and don't know what to do.\", \"output\": \"I'm really sorry that you're feeling this way. Depression can make everything feel heavy and hopeless, but you're not alone. One thing you can try right now is taking slow breaths and reminding yourself that this moment will pass. You may also find comfort in reaching out to someone you trust or speaking with a mental health professional. If you'd like, I can also share a Bible verse that offers hope during dark times. Remember, you deserve care and support. This conversation does not replace professional help\\u2014please reach out to a trained counsellor or healthcare provider if you can.\"}"
    },
    {
        "text": "{\"input\": \"I'm feeling anxious and overwhelmed.\", \"output\": \"Feeling anxious can be very uncomfortable, and I'm glad you reached out. Try grounding yourself by noticing five things around you, or breathing in for four seconds and out for six. You're doing the best you can with what you're facing. Anxiety does not define your strength. If you want, I can share coping strategies, a scripture for calm, or mental health facilities near you. Always remember: this is supportive guidance and should not replace professional care. Please contact a certified healthcare provider if symptoms continue or intensify.\"}"
    },
    {
        "text": "{\"input\": \"I feel alone.\", \"output\": \"Feeling alone can make even simple things feel harder. Please know that your feelings are valid, and reaching out today shows courage. Connecting with others, even in small ways, can slowly bring relief. If you'd like, I can recommend churches, youth groups, or support spaces in your parish. I can also share comforting Bible verses about loneliness. This guidance is here to support you, but it does not replace professional help. Please speak with a mental health professional if these feelings persist.\"}"
    },
    {
        "text": "{\"input\": \"I feel like giving up.\", \"output\": \"I'm really sorry you're feeling this way. Moments like these can feel overwhelming, but they do not define your future. Please pause, breathe, and know that your life has value. Talking to someone right now\\u2014whether a trusted person or a mental health professional\\u2014can make a big difference. If you are in Jamaica, you can call the Suicide Prevention Hotline at 888-639-5433 (NEW-LIFE). You are not alone. This response is supportive only and not a substitute for professional assistance. Please seek immediate help from a trained professional.\"}"
    },
    {
        "text": "{\"input\": \"Can you pray for me?\", \"output\": \"Of course. Here\\u2019s a prayer for comfort: 'Heavenly Father, please cover this person with Your peace. Strengthen their heart, calm their mind, and remind them that they are deeply loved. Walk with them through every challenge and guide them toward hope and healing. Amen.' If you'd like, I can also share Bible verses or nearby churches. Please remember that this support does not replace talking to a trained mental health professional.\"}"
    },
    {
        "text": "{\"input\": \"Can you share a Bible verse for stress?\", \"output\": \"Here is a verse that brings comfort during stress: 'Cast thy burden upon the LORD, and he shall sustain thee' \\u2014 Psalm 55:22 (KJV). If you'd like, I can share more verses or help you find a church or counsellor in your parish. Please keep in mind this support does not replace professional mental health care.\"}"
    },
    {
        "text": "{\"input\": \"I'm having a panic attack, help me.\", \"output\": \"I'm here with you. Try this grounding technique: focus on breathing in slowly through your nose for four seconds, hold for two, and breathe out through your mouth for six seconds. Say to yourself: 'I am safe. This will pass.' Your body is reacting to stress, but you are not in danger. When you feel calmer, consider speaking with a mental health professional to explore what triggered this. This guidance does not replace professional care\\u2014please seek medical help if symptoms worsen.\"}"
    },
    {
        "text": "{\"input\": \"I'm angry and frustrated, what should I do?\", \"output\": \"Anger can build up quickly and feel overwhelming. Try stepping away from the situation for a few minutes and take slow breaths. Physical release\\u2014like walking or stretching\\u2014can help. If you'd like, I can share tools for managing anger or recommend nearby counselling services. Your feelings matter, and support is available. This does not replace speaking with a trained professional.\"}"
    },
    {
        "text": "{\"input\": \"I feel lost in life.\", \"output\": \"Feeling lost can happen during big transitions or stressful seasons. It's okay not to have everything figured out. Try focusing on one small step you can take today, even if it's just writing down how you're feeling. You are allowed to grow at your own pace. If you'd like, I can recommend local churches, counsellors, or scriptures for guidance. This support does not replace professional mental health care\\u2014please reach out to a certified provider if these feelings continue.\"}"
    },
    {
        "text": "{\"input\": \"Where can I find a counsellor in Kingston?\", \"output\": \"Here are counselling options in Kingston: Shekinah House \\u2013 Unit 28, 2 Seymour Avenue, Kingston 6. Phone: (876) 946-0719. If you want, I can also provide churches with counselling ministries. This information is supportive only and does not replace professional diagnosis or treatment. Please follow up with a trained provider.\"}"
    },
    {
        "text": "{\"input\": \"What church can I visit in Mandeville?\", \"output\": \"Here is one option: Mandeville Seventh-day Adventist Church \\u2013 Perth Road, Mandeville, Manchester. They offer weekly worship and community support. If you want more options or churches with counselling ministries, I can provide those too. This guidance is supportive and does not replace professional mental health assistance.\"}"
    },
    {
        "text": "{\"input\": \"Can you encourage me?\", \"output\": \"Of course. You\\u2019ve already shown strength by reaching out. Whatever you\\u2019re facing right now, it won\\u2019t last forever. You are growing, learning, and becoming stronger each day, even if it doesn\\u2019t feel like it. You matter, and your feelings are important. If you'd like encouragement from scripture or guidance based on your parish, I can help. Please remember this is supportive only and does not replace professional mental health care.\"}"
    },
    {
        "text": "{\"input\": \"I have money problems and it's stressing me out.\", \"output\": \"Financial stress can feel very heavy, especially when things seem uncertain. You're not alone\\u2014many people go through this. Try breaking things into manageable steps like budgeting, listing priorities, or reaching out for assistance if needed. I can also share scriptures for provision and peace or connect you with nearby churches that offer support. This guidance does not replace professional mental health or financial counselling.\"}"
    },
    {
        "text": "{\"input\": \"I feel like I can\\u2019t talk to anyone.\", \"output\": \"It\\u2019s painful to feel like you have no one to turn to. I want you to know that reaching out here is a brave first step. If you want, I can help you find a counsellor, church group, or support service in your parish. You are not alone. This conversation is supportive only and does not replace speaking with a trained mental health professional.\"}"
    },
    {
        "text": "{\"input\": \"I'm grieving a loss and it's hard to cope.\", \"output\": \"Grief is a deeply personal and painful journey, and I'm sorry for your loss. It's okay to feel whatever you're feeling\\u2014sadness, anger, or numbness. Be gentle with yourself and take things one day at a time. Talking about the person you lost or writing down memories can sometimes be helpful. If you'd like, I can share a Bible verse about comfort in mourning or help you find a grief support group in your parish. Please remember, this is supportive guidance and not a substitute for professional grief counselling.\"}"
    },
    {
        "text": "{\"input\": \"I'm having trouble sleeping because of my thoughts.\", \"output\": \"It's very common for anxious or sad thoughts to keep us awake at night. You could try creating a calming bedtime routine: avoid screens an hour before bed, write down your worries in a journal, or listen to soft, calming music. A technique called progressive muscle relaxation\\u2014tensing and then relaxing each part of your body\\u2014can also help. If sleep problems continue, it's important to speak with a doctor. This advice is supportive and does not replace professional medical or mental health care.\"}"
    },
    {
        "text": "{\"input\": \"My relationship is causing me a lot of pain.\", \"output\": \"Relationship struggles can be incredibly draining and painful. Your feelings are completely valid. It might help to find a safe space to process your emotions, whether through journaling or speaking with a trusted, neutral person. Considering couples counselling or individual therapy can also provide tools and clarity. If you are in a situation that feels unsafe, please reach out to a trusted authority or a support service like the Jamaica AIDS Support for Life helpline which can offer guidance. This is supportive advice only and not a replacement for professional counselling.\"}"
    },
    {
        "text": "{\"input\": \"I feel like a failure.\", \"output\": \"I hear how much pain you're in, and I'm sorry you're feeling this way. Feelings of failure are often much bigger than the reality. Please try to speak to yourself with the same kindness you'd offer a friend. You are a person of inherent worth, regardless of any single circumstance. If you'd like, I can share scriptures about identity and purpose or help you find a counsellor to work through these feelings. This support does not replace professional mental health care.\"}"
    },
    {
        "text": "{\"input\": \"I'm stressed about work and it's affecting my health.\", \"output\": \"Work-related stress can have a real impact on your physical and mental well-being. It's important to listen to your body. Setting small boundaries, like taking regular breaks and disconnecting after work hours, can make a difference. Please consider speaking with your supervisor about your workload or contacting a mental health professional for coping strategies. I can also share verses for peace or connect you with support. Remember, this is general guidance and not a substitute for professional advice.\"}"
    },
    {
        "text": "{\"input\": \"Can you find me a support group in Montego Bay?\", \"output\": \"I can suggest a starting point for finding support in Montego Bay. You could contact the Cornwall Beach House, which offers various support meetings. For more specific needs, I recommend reaching out to the Ministry of Health & Wellness or a major church in the area like the Montego Bay New Testament Church for information on their support ministries. This information is provided for support and should be verified. It does not replace a recommendation from a healthcare provider.\"}"
    },
    {
        "text": "{\"input\": \"I'm struggling with a bad habit I can't break.\", \"output\": \"It takes a lot of self-awareness to recognize a habit you want to change. Be patient with yourself; change is a process, not a single event. Identifying your triggers and replacing the habit with a healthier action can be a powerful step. You don't have to do this alone\\u2014accountability from a trusted friend, pastor, or counsellor can provide great support. If you'd like, I can share scriptures about renewal and strength. This is supportive guidance and not a replacement for professional addiction counselling if needed.\"}"
    },
    {
        "text": "{\"input\": \"I feel numb and disconnected from everything.\", \"output\": \"Feeling numb can be a way your mind protects you from being overwhelmed, but it can also make you feel isolated. These feelings are valid. Gentle activities that engage your senses, like holding something cold or listening to a favourite song, can sometimes help you feel more grounded. This is often a sign to gently seek professional support to process what's underneath. I am here to listen and can help you find a counsellor in your area. This conversation is supportive and not a substitute for professional care.\"}"
    },
    {
        "text": "{\"input\": \"Pray for my family's healing.\", \"output\": \"Absolutely. Let's pray together: 'Loving God, I lift this family to You. Please surround them with Your healing presence, mend what is broken, and restore their hearts with Your peace. Strengthen their bonds and guide them toward unity and understanding. Amen.' If you would like ongoing support, I can help you find a church community or share Bible verses for family peace. Please remember that this spiritual support complements, but does not replace, professional family therapy if needed.\"}"
    },
    {
        "text": "{\"input\": \"I need a safe place to stay tonight.\", \"output\": \"Your safety is the most important thing. If you are in immediate danger, please call the emergency services at 119. For temporary shelter, you can contact the National Shelter for Victims of Domestic Violence or reach out to the Poor Relief department in your Parish Council. I can help you find contact numbers. This is critical information and you should follow up directly with these services for immediate assistance.\"}"
    },
    {
        "text": "{\"input\": \"I feel guilty about something I did.\", \"output\": \"Guilt can be a heavy burden to carry. It's a sign that you have a conscience and care about doing what's right. Remember that everyone makes mistakes, and forgiveness\\u2014for yourself and from God\\u2014is possible. Talking through this with a pastor or a counsellor can help you find a path forward. If you'd like, I can share scriptures about grace and forgiveness. This is supportive guidance and not a replacement for professional counselling to work through these feelings.\"}"
    },
    {
        "text": "{\"input\": \"Everyone is depending on me and I'm exhausted.\", \"output\": \"Carrying the weight of others' expectations is incredibly draining. It's okay to feel tired, and it's a sign that you may need to replenish your own strength. Setting boundaries and asking for help are signs of wisdom, not weakness. 'Come to me, all you who are weary and burdened, and I will give you rest' (Matthew 11:28). Please consider sharing the load with others or speaking with a counsellor about caregiver burnout. This support does not replace professional advice.\"}"
    },
    {
        "text": "{\"input\": \"I'm so burned out I can't even get out of bed.\", \"output\": \"Burnout completely drains your mental and physical energy, and I'm sorry you're going through this. Please be compassionate with yourself\\u2014this is a sign that you've been under immense pressure. Can you give yourself permission to rest today without guilt? Even one small act of self-care, like drinking a glass of water or opening a window, is an achievement. This is a clear signal to seek support. I can help you find a therapist or recommend a church community for encouragement. Remember, this is supportive guidance and not a substitute for professional medical or mental health care.\"}"
    },
    {
        "text": "{\"input\": \"I feel so much shame about my past.\", \"output\": \"Shame can feel like a heavy weight that isolates you. Please hear this: your past does not define your worth. Many people struggle with these feelings. A powerful step is sharing this burden with a safe person, like a pastor or counsellor, who can offer grace and perspective. 'Therefore, if anyone is in Christ, the new creation has come: The old has gone, the new is here!' (2 Corinthians 5:17). I can share more verses about forgiveness or help you find a confidential support resource. This conversation is supportive and not a replacement for professional therapy.\"}"
    },
    {
        "text": "{\"input\": \"I'm dealing with a chronic illness and it's getting me down.\", \"output\": \"Living with a chronic condition is incredibly challenging, both physically and emotionally. It's completely normal to feel down and frustrated. Your strength in enduring this is noticed. Connecting with others who understand, perhaps through a support group for your condition, can lessen the feeling of being alone. Also, speaking with a counsellor who specializes in chronic illness can provide tailored coping strategies. I can also share scriptures about strength and endurance. This support is not a substitute for professional medical or psychological care.\"}"
    },
    {
        "text": "{\"input\": \"I failed my exams and I feel hopeless about my future.\", \"output\": \"I'm sorry to hear about your exams. This setback feels huge right now, but it does not determine your entire future. Many successful people have faced similar failures. Give yourself time to process the disappointment. Then, you can create a plan to move forward\\u2014speak with your teachers, explore other learning options, or just focus on one next step. If you'd like, I can share a Bible verse about perseverance or help you find a mentor or counsellor to talk to. This is general guidance and not a replacement for academic or professional counselling.\"}"
    },
    {
        "text": "{\"input\": \"I think I need medication for my mental health.\", \"output\": \"Considering medication is a responsible step towards caring for your mental health. It's important to have this conversation with a qualified medical doctor or psychiatrist. They can properly assess your situation, discuss potential benefits and side effects, and prescribe what's right for you. I can help you find a public health clinic or psychiatrist in your parish to get started. Please remember, this information is for support only and must not replace a consultation with a healthcare professional.\"}"
    },
    {
        "text": "{\"input\": \"Someone I care about is self-harming. What do I do?\", \"output\": \"It's frightening and overwhelming when someone you love is self-harming. The most important thing you can do is approach them with compassion, not judgment. Let them know you care and are there to listen. Encourage them gently but firmly to speak with a mental health professional. In Jamaica, they can contact the Ministry of Health\\u2019s Mental Health and Suicide Prevention Helpline. You cannot carry this burden alone\\u2014consider seeking support for yourself as well. This guidance is supportive and not a substitute for professional advice.\"}"
    },
    {
        "text": "{\"input\": \"I'm new in town and don't know anyone.\", \"output\": \"Moving to a new place can be lonely, and it's brave to acknowledge that. A great way to build connection is to find a community based on your interests or faith. I can help you find churches, community centres, or social groups in your area. Even small, consistent interactions, like visiting the same cafe or library, can help you start to feel at home. If you're struggling with loneliness, speaking to a counsellor can also help. This is supportive guidance and not a replacement for professional help if needed.\"}"
    },
    {
        "text": "{\"input\": \"I'm scared I'll never get over this.\", \"output\": \"When you're in the middle of a painful situation, it can feel like it will last forever. But feelings and circumstances do change. You have already shown resilience by facing each day. Try to focus on just getting through today, not the rest of your life. 'Weeping may endure for a night, but joy cometh in the morning' (Psalm 30:5). I am here to listen and can help you find a therapist to walk with you through this healing process. This support does not replace professional mental health care.\"}"
    },
    {
        "text": "{\"input\": \"Can you share a Bible verse for when you feel unloved?\", \"output\": \"Certainly. Here is a powerful reminder of God's love: 'See what great love the Father has lavished on us, that we should be called children of God! And that is what we are!' \\u2014 1 John 3:1 (NIV). You are deeply and unconditionally loved. If you'd like more verses or to connect with a church community where you can experience this love in person, I can help. Please remember that this spiritual support is a complement to, not a replacement for, professional care for feelings of low self-worth or depression.\"}"
    },
    {
        "text": "{\"input\": \"I'm being bullied at work/school.\", \"output\": \"I'm so sorry you're experiencing this. No one deserves to be bullied. Your safety and well-being are the priority. If you feel safe doing so, document the incidents and report them to a trusted authority figure\\u2014a supervisor, HR representative, teacher, or school counsellor. You do not have to handle this alone. Speaking with a counsellor can also help you build strategies to cope with the stress. If you'd like, I can help you find local support services. This is general guidance and not a substitute for legal or professional advice.\"}"
    },
    {
        "text": "{\"input\": \"I feel lost.\", \"output\": \"I\\u2019m really glad you reached out and shared that you feel lost. That can be a heavy feeling. You don\\u2019t have to figure everything out at once.\\n\\nHere are a few scriptures you can reflect on:\\n- Proverbs 3:5\\u20136 (KJV): Trust in the LORD with all thine heart; and he shall direct thy paths.\\n- Psalm 32:8 (KJV): I will instruct thee and teach thee in the way which thou shalt go.\\n\\nYou might find it helpful to:\\n- Talk honestly with God about how confused you feel.\\n- Write down one small step you can take today (like talking to a trusted person, your pastor, or a counselor).\\n\\n\\ud83e\\udde0 Please remember: This response is for support and encouragement only and is **not a substitute** for professional care. If these feelings continue or get worse, please speak with a licensed mental health professional. If you are in Jamaica and feel you are in crisis, you can call the Mental Health & Suicide Prevention Helpline at **888-NEW-LIFE (888-639-5433)** or emergency services at **119**.\"}"
    },
    {
        "text": "{\"input\": \"I feel sad.\", \"output\": \"I\\u2019m sorry that you\\u2019re feeling sad. That\\u2019s a real emotion and it matters. You don\\u2019t have to pretend you\\u2019re okay with me.\\n\\nSome scriptures that may comfort you:\\n- Psalm 34:18 (KJV): The LORD is nigh unto them that are of a broken heart.\\n- Psalm 30:5 (KJV): Weeping may endure for a night, but joy cometh in the morning.\\n\\nYou could try:\\n- Telling God honestly how you feel in prayer.\\n- Reaching out to a trusted friend, family member, or church leader.\\n- Doing one gentle activity you enjoy (a short walk, worship music, journaling).\\n\\n\\ud83e\\udde0 This response is encouragement only and **not medical or psychological advice**. If sadness is ongoing, affecting your sleep, appetite, or ability to function, please talk with a licensed mental health professional. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you feel you\\u2019re in crisis.\"}"
    },
    {
        "text": "{\"input\": \"I feel angry.\", \"output\": \"Thank you for being honest about your anger. Anger itself isn\\u2019t sinful, but how we act with it really matters.\\n\\nScriptures to reflect on:\\n- Ephesians 4:26 (KJV): Be ye angry, and sin not.\\n- James 1:19 (KJV): Let every man be swift to hear, slow to speak, slow to wrath.\\n\\nYou might try:\\n- Taking a pause to breathe before reacting.\\n- Writing down what triggered you and what you wish could change.\\n- Talking to someone safe (a counselor, pastor, or trusted friend) about what\\u2019s under the anger \\u2013 hurt, fear, or disappointment.\\n\\n\\ud83e\\udde0 Please remember: This is general support, not professional advice. If anger is leading to aggressive behaviour, harming relationships, or thoughts of hurting yourself or others, please contact a licensed mental health professional. In Jamaica, if you feel out of control or in crisis, call **888-NEW-LIFE (888-639-5433)** or emergency services at **119**.\"}"
    },
    {
        "text": "{\"input\": \"I feel alone.\", \"output\": \"Feeling alone can be very painful, and I\\u2019m glad you shared that. Your feelings are valid, and you are not forgotten.\\n\\nScriptures to consider:\\n- Deuteronomy 31:8 (KJV): He will be with thee, he will not fail thee, neither forsake thee.\\n- Psalm 68:6 (KJV): God setteth the solitary in families.\\n\\nYou could try:\\n- Praying honestly and telling God you feel alone.\\n- Reaching out to someone you trust by call or text, even if it feels awkward.\\n- Connecting with a church or support group in your parish for community.\\n\\n\\ud83e\\udde0 This response is for comfort and information only. If loneliness is affecting your mental health or you\\u2019re having thoughts of harming yourself, please speak with a licensed counselor or psychologist. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you are in crisis.\"}"
    },
    {
        "text": "{\"input\": \"I feel anxious.\", \"output\": \"Anxiety can feel overwhelming, and you\\u2019re not weak for feeling this way. Thank you for sharing it.\\n\\nScriptures to meditate on:\\n- Philippians 4:6\\u20137 (KJV): Be careful for nothing; but in every thing by prayer and supplication... and the peace of God shall keep your hearts and minds.\\n- 1 Peter 5:7 (KJV): Casting all your care upon him; for he careth for you.\\n\\nPractical steps that might help:\\n- Take slow, deep breaths in through your nose and out through your mouth.\\n- Ground yourself by noticing 5 things you can see, 4 you can touch, 3 you can hear, 2 you can smell, 1 you can taste.\\n- Talk with someone you trust, or schedule time with a counselor.\\n\\n\\ud83e\\udde0 This is not a diagnosis or treatment. If anxiety is constant, causing panic attacks, or stopping you from functioning, please speak with a licensed mental health professional. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** in a crisis.\"}"
    },
    {
        "text": "{\"input\": \"I feel overwhelmed.\", \"output\": \"Feeling overwhelmed is a lot to carry, and it\\u2019s okay to admit that you\\u2019re struggling. You don\\u2019t have to do everything perfectly.\\n\\nScriptures for encouragement:\\n- Matthew 11:28 (KJV): Come unto me, all ye that labour and are heavy laden, and I will give you rest.\\n- Isaiah 40:31 (KJV): They that wait upon the LORD shall renew their strength.\\n\\nYou can try:\\n- Breaking tasks into small steps and focusing on one thing at a time.\\n- Taking short pauses to pray or breathe when you feel overloaded.\\n- Asking for help from family, friends, your church, or a counselor.\\n\\n\\ud83e\\udde0 This response is supportive, but it is **not a substitute** for professional care. If you feel constantly overwhelmed, burned out, or unable to cope, please talk with a licensed mental health professional. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you are in crisis.\"}"
    },
    {
        "text": "{\"input\": \"I feel depressed.\", \"output\": \"I\\u2019m really sorry you\\u2019re feeling depressed. That\\u2019s not something you can just \\u2018snap out of,\\u2019 and your feelings are important.\\n\\nScriptures that may bring hope:\\n- Psalm 34:18 (KJV): The LORD is nigh unto them that are of a broken heart.\\n- Psalm 42:11 (KJV): Hope thou in God: for I shall yet praise him.\\n\\nYou might:\\n- Tell God honestly how heavy everything feels.\\n- Reach out to a trusted person so you\\u2019re not carrying this alone.\\n- Consider seeing a doctor or licensed therapist to talk through these feelings.\\n\\n\\ud83e\\udde0 This response can\\u2019t diagnose or treat depression. If you\\u2019re feeling depressed most days, can\\u2019t enjoy things, or are thinking about hurting yourself, **please contact a licensed mental health professional right away**. In Jamaica, call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you are in immediate danger.\"}"
    },
    {
        "text": "{\"input\": \"I feel like giving up.\", \"output\": \"I\\u2019m really glad you typed that, even though it\\u2019s hard. Feeling like giving up is serious, and you deserve support and safety.\\n\\nPlease remember:\\n- Your life has real value, even when it doesn\\u2019t feel like it.\\n- God sees your pain and cares deeply about you.\\n\\nScriptures for hope:\\n- Isaiah 41:10 (KJV): Fear thou not; for I am with thee.\\n- Jeremiah 29:11 (KJV): I know the thoughts that I think toward you... to give you an expected end.\\n\\nVery important next steps:\\n- Please talk to someone you trust **today** \\u2013 a friend, family member, pastor, or counselor.\\n- If you feel you might harm yourself, do not stay alone with these thoughts.\\n\\n\\ud83e\\udde0 This conversation **cannot** replace urgent, face-to-face care. If you are in Jamaica and feel like you might hurt yourself or someone else, please call the **Mental Health & Suicide Prevention Helpline at 888-NEW-LIFE (888-639-5433)** or emergency services at **119**, or go to the nearest hospital emergency department.\"}"
    },
    {
        "text": "{\"input\": \"I\\u2019m having thoughts of hurting myself.\", \"output\": \"I\\u2019m really grateful you shared that. Thoughts of hurting yourself are serious, and you deserve immediate care and support. You do not have to face this alone.\\n\\nFirst, please know:\\n- Your life is precious and deeply valued by God and by others.\\n- These thoughts are a sign that you need extra support right now, not a sign of weakness.\\n\\nSteps you can take **right now**:\\n- If you are in immediate danger, please call emergency services at **119** in Jamaica.\\n- You can also call the **Mental Health & Suicide Prevention Helpline: 888-NEW-LIFE (888-639-5433)** to speak with someone who is trained to help in crisis.\\n- Try to stay around someone you trust and remove anything you could use to harm yourself.\\n\\nA scripture of comfort:\\n- Psalm 34:17\\u201318 (KJV): The righteous cry, and the LORD heareth... The LORD is nigh unto them that are of a broken heart.\\n\\n\\ud83e\\udde0 This response is **not** enough on its own. Please reach out to a licensed mental health professional, doctor, or counselor as soon as possible. Getting professional help is a strong and brave step.\"}"
    },
    {
        "text": "{\"input\": \"I feel ashamed and guilty about my past.\", \"output\": \"Shame and guilt can feel very heavy, but bringing them into the light like this is a powerful step. God does not abandon you because of your past.\\n\\nScriptures to meditate on:\\n- 1 John 1:9 (KJV): If we confess our sins, he is faithful and just to forgive us.\\n- Psalm 103:12 (KJV): As far as the east is from the west, so far hath he removed our transgressions from us.\\n\\nYou might consider:\\n- Talking honestly with God about your guilt and asking for forgiveness.\\n- Sharing with a trusted person or counselor who can support you in healing.\\n- Remembering Bible characters like Peter, who denied Jesus but was restored and used powerfully by God (John 21).\\n\\n\\ud83e\\udde0 This response offers spiritual and emotional support, but it\\u2019s **not a replacement** for professional counseling. If guilt and shame are affecting your daily life, please speak with a licensed mental health professional or a trained Christian counselor. In Jamaica, you can also call **888-NEW-LIFE (888-639-5433)** for mental health support.\"}"
    },
    {
        "text": "{\"input\": \"I feel like God is far from me.\", \"output\": \"Feeling like God is far away can be very painful, especially when you\\u2019re struggling. Many people in the Bible felt that way too.\\n\\nFor example:\\n- David often felt abandoned, yet he cried out to God honestly (see Psalm 13).\\n\\nScriptures to reflect on:\\n- Hebrews 13:5 (KJV): I will never leave thee, nor forsake thee.\\n- Psalm 34:18 (KJV): The LORD is nigh unto them that are of a broken heart.\\n\\nYou might try:\\n- Praying honestly and telling God you feel distant.\\n- Reading a Psalm each day and turning its words into your own prayer.\\n- Talking with a pastor or mature believer about what you\\u2019re feeling.\\n\\n\\ud83e\\udde0 This response gives spiritual encouragement, but it is **not a substitute** for professional mental health support. If these feelings are tied to depression, anxiety, or trauma, please reach out to a licensed counselor or psychologist. In Jamaica, you can also call **888-NEW-LIFE (888-639-5433)** for support.\"}"
    },
    {
        "text": "{\"input\": \"Which mental health helplines are available in Jamaica?\", \"output\": \"In Jamaica, there are several important mental health support options:\\n\\n\\ud83d\\udcde **Mental Health & Suicide Prevention Helpline**\\n- Number: **888-NEW-LIFE (888-639-5433)**\\n- Service: 24/7 crisis and emotional support from trained counselors.\\n\\n\\ud83d\\udcf2 **U-Matter Chatline (for young people 16\\u201324 years)**\\n- Text **SUPPORT** to **876-838-4897**\\n- Available via Instagram and Facebook Messenger @ureportjamaica.\\n\\n\\ud83e\\udde0 Please remember: This information is for support only and may change over time. Always check the Ministry of Health & Wellness Jamaica or official government sources for the most current details. This response does **not** replace professional medical or psychological care. If you or someone else is in immediate danger, call **119** or go to the nearest hospital.\"}"
    },
    {
        "text": "{\"input\": \"Can you recommend mental health services in Kingston and St. Andrew?\", \"output\": \"Yes, I can share some key mental health resources in Kingston & St. Andrew (information may change over time, so it\\u2019s good to call ahead):\\n\\n\\ud83c\\udfe5 **Bellevue Hospital** \\u2013 Public Psychiatric Hospital\\n- Address: 16\\u00bd Windward Road, Kingston 2, Jamaica\\n- Services: Inpatient and outpatient psychiatric care, psychological services.\\n\\n\\ud83c\\udfe5 **University Hospital of the West Indies (UHWI)** \\u2013 Teaching Hospital\\n- Location: Mona, Kingston\\n- Services: General hospital care, psychiatric/mental health services via clinics and referrals.\\n\\n\\ud83c\\udfe5 **Kingston Public Hospital (KPH)**\\n- Location: North Street, Kingston\\n- Services: General hospital services, emergency care and referrals for mental health.\\n\\n\\ud83c\\udfe5 **Shekinah House** \\u2013 Private Facility\\n- Address: Unit 28, 2 Seymour Avenue, Kingston 6, Jamaica\\n- Services: Psychiatry, psychology, family and marital counseling.\\n\\nThere are also private psychologists, counselors, and church-based counseling ministries in the corporate area.\\n\\n\\ud83e\\udde0 This information is for guidance only and may not be complete or fully up to date. It does **not** replace professional advice. Always contact the facility directly to confirm services and hours. If you are in crisis in Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119**.\"}"
    },
    {
        "text": "{\"input\": \"Can you recommend mental health services in Manchester, Jamaica?\", \"output\": \"Here are some options connected with Manchester (Mandeville area). Please note that details can change, so call ahead:\\n\\n\\ud83c\\udfe5 **Mandeville Regional Hospital**\\n- Location: Mandeville, Manchester\\n- Services: General hospital services with access to mental health support through the public system.\\n\\n\\ud83c\\udfe5 **Percy Junor Hospital**\\n- Location: Spalding (serving parts of Manchester and Clarendon)\\n\\n\\ud83c\\udfe5 **Hargreaves Memorial Hospital** (Private)\\n- Location: Mandeville\\n\\n\\ud83e\\udde0 In addition, private psychologists and counselors in Manchester offer therapy services (including churches and Christian counselors). You can also contact the national **Mental Health & Suicide Prevention Helpline \\u2013 888-NEW-LIFE (888-639-5433)** for guidance.\\n\\nThis response is for information only and does **not** replace professional advice. Always confirm services, costs, and opening hours directly with the provider, and speak with a licensed mental health professional for care.\"}"
    },
    {
        "text": "{\"input\": \"Can you recommend mental health services in St. James, Jamaica?\", \"output\": \"St. James (Montego Bay area) has several important health facilities. Details can change, so please contact them directly to confirm services:\\n\\n\\ud83c\\udfe5 **Cornwall Regional Hospital (CRH)** \\u2013 Public Hospital\\n- Location: Montego Bay, St. James\\n- Services: General hospital services; public mental health services are coordinated through the regional health authority.\\n\\n\\ud83c\\udfe5 **CUMI (Committee for the Upliftment of the Mentally Ill) Rehabilitation Day Centre**\\n- Location: Montego Bay\\n- Services: Rehabilitation, psychosocial support, and community reintegration for persons living with mental illness.\\n\\nThere are also private medical centres and counseling practices in Montego Bay that offer psychological or psychiatric services.\\n\\n\\ud83e\\udde0 This information is for guidance only and may not be complete or fully current. It does **not** replace professional advice. For immediate mental health support in Jamaica, call **888-NEW-LIFE (888-639-5433)** or emergency services at **119**.\"}"
    },
    {
        "text": "{\"input\": \"Can you recommend churches in Kingston where I might find support?\", \"output\": \"Many churches in Kingston & St. Andrew offer spiritual support, prayer, and sometimes counseling or small groups. Here are just a few examples (you can explore others near you):\\n\\n\\u26ea **Swallowfield Chapel** \\u2013 Kingston 5\\n\\u26ea **Kencot Seventh-day Adventist Church** \\u2013 Kingston 10\\n\\u26ea **Pentecostal Tabernacle** \\u2013 Wildman Street, Kingston\\n\\nMost churches have:\\n- Sunday worship services\\n- Mid-week Bible studies or prayer meetings\\n- Youth or small group ministries\\n\\nYou can:\\n- Call or visit their websites/social pages to confirm service times and counseling ministries.\\n- Ask if they have trained counselors or can refer you to Christian counselors in your parish.\\n\\n\\ud83e\\udde0 This response is for spiritual and community guidance only and is **not** professional mental health care. Church support can be a wonderful complement to therapy, but not a replacement. If you\\u2019re struggling with your mental health, please also contact a licensed mental health professional or call **888-NEW-LIFE (888-639-5433)** in Jamaica for support.\"}"
    },
    {
        "text": "{\"input\": \"What Bible characters struggled with feeling depressed or discouraged?\", \"output\": \"Several Bible characters went through deep emotional struggles, including what today might look like depression or intense discouragement:\\n\\n- **Elijah** (1 Kings 19): After a great victory, he felt so overwhelmed and afraid that he asked God to let him die. God met him with rest, food, and a gentle voice.\\n- **David** (Psalms 13, 42, 143): He often wrote about feeling downcast, abandoned, and overwhelmed, yet he kept turning to God in honesty and hope.\\n- **Job** (Book of Job): He experienced extreme loss and grief. He wished he had never been born, but continued to wrestle with God and eventually saw restoration.\\n- **Jeremiah** (Jeremiah 20): He felt mocked, rejected, and deeply discouraged by his calling, but God strengthened him to keep going.\\n\\nTheir stories show that God is not surprised by our emotional pain and that He meets people in their darkest moments.\\n\\n\\ud83e\\udde0 This response is for spiritual teaching and encouragement only. If you\\u2019re feeling depressed or hopeless, please speak with a licensed mental health professional. In Jamaica, you can also call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you are in crisis.\"}"
    },
    {
        "text": "{\"input\": \"Can you share Bible verses that encourage me when I feel anxious?\", \"output\": \"Absolutely. Here are some Bible verses that many people hold onto when they feel anxious:\\n\\n- **Philippians 4:6\\u20137 (KJV)** \\u2013 Be careful for nothing; but in every thing by prayer and supplication with thanksgiving let your requests be made known unto God.\\n- **Isaiah 41:10 (KJV)** \\u2013 Fear thou not; for I am with thee: be not dismayed; for I am thy God.\\n- **1 Peter 5:7 (KJV)** \\u2013 Casting all your care upon him; for he careth for you.\\n- **Psalm 56:3 (KJV)** \\u2013 What time I am afraid, I will trust in thee.\\n\\nYou can:\\n- Pick one verse, write it down, and repeat it slowly while breathing deeply.\\n- Turn the verse into a personal prayer.\\n\\n\\ud83e\\udde0 These verses are a powerful source of comfort, but they are **not a replacement** for professional mental health care. If anxiety is seriously affecting your daily life, please speak with a licensed counselor or doctor. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** for support.\"}"
    },
    {
        "text": "{\"input\": \"Can you check in with me about my mental health?\", \"output\": \"Of course. Let\\u2019s do a gentle check-in:\\n\\n1\\ufe0f\\u20e3 How would you describe how you\\u2019re feeling right now in one or two words (for example: sad, anxious, tired, hopeful)?\\n2\\ufe0f\\u20e3 Is there one situation that\\u2019s been weighing on your mind the most?\\n3\\ufe0f\\u20e3 Have you been able to eat, sleep, and take care of basic things lately?\\n\\nRemember:\\n- It\\u2019s okay to not be okay.\\n- God cares about every part of your life, including your mental and emotional health.\\n\\nYou might also:\\n- Journal your answers to these questions.\\n- Share them with a trusted person, counselor, or pastor.\\n\\n\\ud83e\\udde0 This check-in is for support and reflection only. It does **not** replace professional assessment or treatment. If your mental health has been worsening, or you\\u2019re thinking about harming yourself, please contact a licensed mental health professional. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services **119** right away.\"}"
    },
    {
        "text": "{\"topic\": \"anxiety\", \"emotions\": [\"worry\", \"fear\", \"racing_thoughts\"], \"reference\": \"Philippians 4:6-7 (KJV)\", \"verse_text_kjv\": \"Be careful for nothing; but in every thing by prayer and supplication with thanksgiving let your requests be made known unto God. And the peace of God, which passeth all understanding, shall keep your hearts and minds through Christ Jesus.\", \"explanation\": \"Encourage the user to bring their worries to God honestly, while also reminding them that it is healthy to seek professional help if anxiety is ongoing or severe.\"}"
    },
    {
        "text": "{\"topic\": \"depression\", \"emotions\": [\"hopelessness\", \"sadness\", \"emptiness\"], \"reference\": \"Psalm 34:18 (KJV)\", \"verse_text_kjv\": \"The LORD is nigh unto them that are of a broken heart; and saveth such as be of a contrite spirit.\", \"explanation\": \"Use when someone feels broken or alone, reminding them that God is close to the brokenhearted.\"}"
    },
    {
        "text": "{\"topic\": \"fear\", \"emotions\": [\"panic\", \"terror\", \"night_fears\"], \"reference\": \"Isaiah 41:10 (KJV)\", \"verse_text_kjv\": \"Fear thou not; for I am with thee: be not dismayed; for I am thy God: I will strengthen thee; yea, I will help thee; yea, I will uphold thee with the right hand of my righteousness.\", \"explanation\": \"Use when someone feels overwhelmed by fear and needs reassurance that they are not alone.\"}"
    },
    {
        "text": "{\"topic\": \"stress_and_burden\", \"emotions\": [\"overwhelm\", \"pressure\", \"burnout\"], \"reference\": \"Matthew 11:28 (KJV)\", \"verse_text_kjv\": \"Come unto me, all ye that labour and are heavy laden, and I will give you rest.\", \"explanation\": \"Use when someone feels worn out and exhausted, while reminding them about healthy rest and seeking professional support.\"}"
    },
    {
        "text": "{\"topic\": \"hopelessness\", \"emotions\": [\"despair\", \"giving_up\"], \"reference\": \"Lamentations 3:21-23 (KJV)\", \"verse_text_kjv\": \"This I recall to my mind, therefore have I hope. It is of the LORD'S mercies that we are not consumed, because his compassions fail not. They are new every morning: great is thy faithfulness.\", \"explanation\": \"Use when someone feels like nothing will ever change, to gently point them toward hope.\"}"
    },
    {
        "text": "{\"topic\": \"anger\", \"emotions\": [\"rage\", \"irritation\", \"frustration\"], \"reference\": \"James 1:19-20 (KJV)\", \"verse_text_kjv\": \"Wherefore, my beloved brethren, let every man be swift to hear, slow to speak, slow to wrath: For the wrath of man worketh not the righteousness of God.\", \"explanation\": \"Use when someone struggles with anger, alongside suggestions for healthy ways to process it.\"}"
    },
    {
        "text": "{\"character\": \"Elijah\", \"struggles\": [\"despair\", \"burnout\", \"suicidal_thoughts\", \"fear\"], \"summary\": \"After a great victory over the prophets of Baal, Elijah fled from Jezebel, felt alone, exhausted and asked God to let him die.\", \"key_passages_kjv\": [\"1 Kings 19:1-18\"], \"notes_for_model\": \"Use Elijah when someone feels totally overwhelmed, tired of life, or hopeless. Show that God listened, provided rest, food and gentle encouragement.\"}"
    },
    {
        "text": "{\"character\": \"David\", \"struggles\": [\"deep_sadness\", \"guilt\", \"fear\", \"loneliness\"], \"summary\": \"David went through seasons of fear, betrayal and deep emotional pain, and expressed it openly in the Psalms.\", \"key_passages_kjv\": [\"Psalm 13:1-6\", \"Psalm 42:1-11\", \"Psalm 51:1-12\"], \"notes_for_model\": \"Use David when someone feels down, guilty, or alone. Emphasize honest prayer, pouring out feelings to God, and hope returning.\"}"
    },
    {
        "text": "{\"character\": \"Job\", \"struggles\": [\"grief\", \"suffering\", \"loss\", \"questioning_God\"], \"summary\": \"Job lost his children, health and possessions, experienced deep anguish, and wrestled with big questions about suffering.\", \"key_passages_kjv\": [\"Job 3:1-26\", \"Job 6:1-13\", \"Job 19:25-27\"], \"notes_for_model\": \"Use Job when someone faces intense loss or feels like life is unfair. Acknowledge pain and show that God can still be present in suffering.\"}"
    },
    {
        "text": "{\"character\": \"Hannah\", \"struggles\": [\"bitterness_of_soul\", \"longing\", \"family_conflict\"], \"summary\": \"Hannah was deeply distressed over infertility, misunderstood by others, and poured out her soul to God in the temple.\", \"key_passages_kjv\": [\"1 Samuel 1:1-20\"], \"notes_for_model\": \"Use Hannah when someone feels misunderstood, desperate for change, or struggling with unfulfilled desires.\"}"
    },
    {
        "text": "{\"character\": \"Jeremiah\", \"struggles\": [\"discouragement\", \"rejection\", \"emotional_pain\"], \"summary\": \"Jeremiah was called to a difficult ministry, often felt mocked and alone, and expressed deep emotional struggle.\", \"key_passages_kjv\": [\"Jeremiah 20:7-11\", \"Lamentations 3:17-26\"], \"notes_for_model\": \"Use Jeremiah when someone feels worn down by their calling, rejected or discouraged.\"}"
    },
    {
        "text": "{\"character\": \"Naomi\", \"struggles\": [\"grief\", \"bitterness\", \"hopelessness\"], \"summary\": \"Naomi lost her husband and sons, felt that her life had become bitter, and believed her future was hopeless.\", \"key_passages_kjv\": [\"Ruth 1:1-21\"], \"notes_for_model\": \"Use Naomi when someone feels their life has become bitter or meaningless after loss.\"}"
    },
    {
        "text": "{\"character\": \"Paul\", \"struggles\": [\"hardship\", \"despair_of_life\", \"weakness\"], \"summary\": \"Paul described times when he was burdened beyond measure and despaired even of life, yet found strength in God.\", \"key_passages_kjv\": [\"2 Corinthians 1:8-10\", \"2 Corinthians 12:7-10\"], \"notes_for_model\": \"Use Paul when someone feels they cannot handle their pressures. Emphasize God's strength in weakness.\"}"
    },
    {
        "text": "{\"character\": \"Jonah\", \"struggles\": [\"anger\", \"resentment\", \"wanting_to_die\"], \"summary\": \"Jonah ran from God, became angry when God showed mercy, and at one point said it was better for him to die than to live.\", \"key_passages_kjv\": [\"Jonah 4:1-11\"], \"notes_for_model\": \"Use Jonah when someone feels angry, resentful or hopeless about their situation.\"}"
    },
    {
        "text": "{\"mental_health_helpline\": {\"name\": \"Jamaica Mental Health & Suicide Prevention Helpline\", \"phone\": \"888-NEW-LIFE (639-5433)\", \"type\": \"helpline\", \"coverage\": \"nationwide\", \"hours\": \"24/7\", \"notes\": \"Official Ministry of Health & Wellness helpline for mental health and suicide prevention.\"}}"
    },
    {
        "text": "{\"parish\": \"Kingston & St. Andrew\", \"hospitals\": [{\"name\": \"Kingston Public Hospital\", \"type\": \"public_general\", \"address\": \"North Street, Kingston, Jamaica\", \"phone\": null, \"services\": [\"emergency\", \"general_medical\", \"some_psychiatric_support\"]}, {\"name\": \"University Hospital of the West Indies\", \"type\": \"teaching_hospital\", \"address\": \"Mona, Kingston 7, Jamaica\", \"phone\": null, \"services\": [\"emergency\", \"inpatient\", \"psychiatry_clinic\"]}, {\"name\": \"Bustamante Hospital for Children\", \"type\": \"public_children\", \"address\": \"Arthur Wint Drive, Kingston 5, Jamaica\", \"phone\": null, \"services\": [\"pediatrics\", \"emergency\"]}, {\"name\": \"Bellevue Hospital\", \"type\": \"public_psychiatric\", \"address\": \"16\\u00bd Windward Road, Kingston 2, Jamaica\", \"phone\": \"(876) 928-1380-9\", \"services\": [\"acute_psychiatric_care\", \"inpatient_mental_health\", \"psychological_services\", \"rehabilitation\"]}], \"mental_health_facilities\": [{\"name\": \"Bellevue Hospital Psychological Services\", \"type\": \"public_psychiatric_service\", \"address\": \"16\\u00bd Windward Road, Kingston 2, Jamaica\", \"phone\": \"(876) 928-1380-9\", \"notes\": \"Psychological and psychiatric services through Bellevue Hospital.\"}, {\"name\": \"Shekinah House\", \"type\": \"private_clinic\", \"address\": \"Unit 28, 2 Seymour Avenue, Kingston 6, Jamaica\", \"phone\": \"(876) 946-0719\", \"services\": [\"psychiatry\", \"psychology\", \"family_and_marital_counselling\", \"child_and_adolescent_psychiatry\"]}], \"psychologists_and_counsellors\": [{\"name\": \"Shekinah House \\u2013 Psychiatry & Psychology Team\", \"profession\": [\"psychiatrist\", \"psychologist\"], \"address\": \"Unit 28, 2 Seymour Avenue, Kingston 6, Jamaica\", \"phone\": \"(876) 946-0719\", \"website\": \"https://www.shekinahhousejm.com\", \"notes\": \"Private multidisciplinary team offering psychiatry, psychology and counselling.\"}], \"churches\": []}"
    },
    {
        "text": "{\"parish\": \"Manchester\", \"hospitals\": [{\"name\": \"Mandeville Regional Hospital\", \"type\": \"public_general\", \"address\": \"Mandeville, Manchester, Jamaica\", \"phone\": null, \"services\": [\"emergency\", \"inpatient\", \"outpatient\"]}, {\"name\": \"Percy Junor Hospital\", \"type\": \"public_general\", \"address\": \"Spalding, Clarendon/Manchester border, Jamaica\", \"phone\": null, \"services\": [\"emergency\", \"general_medical\"]}, {\"name\": \"Hargreaves Memorial Hospital\", \"type\": \"private_hospital\", \"address\": \"Mandeville, Manchester, Jamaica\", \"phone\": null, \"services\": [\"private_medical_care\"]}], \"mental_health_facilities\": [{\"name\": \"Heartland Psychological Services\", \"type\": \"private_practice\", \"address\": \"Mandeville, Manchester, Jamaica\", \"phone\": \"876-236-1680\", \"services\": [\"psychological_assessment\", \"therapy\", \"counselling\"]}], \"psychologists_and_counsellors\": [{\"name\": \"Heartland Psychological Services\", \"profession\": [\"psychologist\"], \"address\": \"Mandeville, Manchester, Jamaica\", \"phone\": \"876-236-1680\", \"notes\": \"Private psychological services, emotional healing and counselling.\"}], \"churches\": []}"
    },
    {
        "text": "{\"parish\": \"St. James\", \"hospitals\": [{\"name\": \"Cornwall Regional Hospital\", \"type\": \"public_general\", \"address\": \"Mount Salem, Montego Bay, St. James, Jamaica\", \"phone\": null, \"services\": [\"emergency\", \"inpatient\", \"outpatient\"]}, {\"name\": \"Falmouth Hospital\", \"type\": \"public_general\", \"address\": \"Falmouth, Trelawny (serves nearby parishes)\", \"phone\": null, \"services\": [\"emergency\", \"general_medical\"]}], \"mental_health_facilities\": [{\"name\": \"CUMI Rehabilitation Day Centre\", \"type\": \"rehabilitation_centre\", \"address\": \"Montego Bay, St. James, Jamaica\", \"phone\": null, \"services\": [\"community_mental_health_rehabilitation\", \"counselling\", \"day_programmes\"]}, {\"name\": \"Fairview Medical & Dental Centre \\u2013 Mental Health Services\", \"type\": \"medical_centre\", \"address\": \"Fairview, Montego Bay, St. James, Jamaica\", \"phone\": null, \"services\": [\"psychiatry\", \"psychology\", \"counselling\"]}], \"psychologists_and_counsellors\": [], \"churches\": []}"
    },
    {
        "text": "{\"parish\": \"Clarendon\", \"hospitals\": [{\"name\": \"May Pen Hospital\", \"type\": \"public_general\", \"address\": \"May Pen, Clarendon, Jamaica\", \"phone\": null, \"services\": [\"emergency\", \"inpatient\", \"outpatient\"]}, {\"name\": \"Chapelton Hospital\", \"type\": \"public_general\", \"address\": \"Chapelton, Clarendon, Jamaica\", \"phone\": null, \"services\": [\"emergency\", \"general_medical\"]}, {\"name\": \"Lionel Town Community Hospital\", \"type\": \"public_general\", \"address\": \"Lionel Town, Clarendon, Jamaica\", \"phone\": null, \"services\": [\"emergency\", \"general_medical\"]}], \"mental_health_facilities\": [], \"psychologists_and_counsellors\": [], \"churches\": []}"
    },
    {
        "text": "{\"parish\": \"Kingston\", \"churches\": [{\"name\": \"Swallowfield Chapel\", \"address\": \"5\\u20139 Swallowfield Road, Kingston 5, Jamaica\", \"service_times\": {\"sunday\": \"10:00 AM\", \"wednesday\": \"7:00 PM Prayer Meeting\"}, \"contact\": \"876-929-3414\"}, {\"name\": \"Pentecostal Tabernacle\", \"address\": \"66 Wildman Street, Kingston, Jamaica\", \"service_times\": {\"sunday\": \"7:00 AM & 10:30 AM\", \"tuesday\": \"7:00 PM Bible Study\", \"friday\": \"7:00 PM Youth Service\"}, \"contact\": \"876-922-6977\"}, {\"name\": \"Kencot Seventh-day Adventist Church\", \"address\": \"10-12 Osbourne Road, Kingston 10, Jamaica\", \"service_times\": {\"saturday\": \"9:00 AM Sabbath School, 11:00 AM Divine Hour\", \"wednesday\": \"7:00 PM Prayer Meeting\"}, \"contact\": \"876-960-1518\"}]}"
    },
    {
        "text": "{\"parish\": \"St. Andrew\", \"churches\": [{\"name\": \"Church on the Rock\", \"address\": \"7 Clifton Avenue, Kingston 8, Jamaica\", \"service_times\": {\"sunday\": \"8:00 AM & 10:30 AM\", \"wednesday\": \"7:00 PM Prayer Meeting\"}, \"contact\": \"876-925-4673\"}, {\"name\": \"Hope Fellowship Church\", \"address\": \"3 Hampden Road, Kingston 10, Jamaica\", \"service_times\": {\"sunday\": \"10:00 AM\", \"thursday\": \"6:30 PM Bible Study\"}, \"contact\": \"876-926-6612\"}]}"
    },
    {
        "text": "{\"parish\": \"St. James\", \"churches\": [{\"name\": \"Faith Temple Assembly of God\", \"address\": \"6 Princess Street, Montego Bay, St. James\", \"service_times\": {\"sunday\": \"8:30 AM & 11:00 AM\", \"wednesday\": \"7:00 PM Prayer Meeting\"}, \"contact\": \"876-952-3436\"}]}"
    },
    {
        "text": "{\"parish\": \"Manchester\", \"churches\": [{\"name\": \"Mandeville SDA Church\", \"address\": \"2 Perth Road, Mandeville, Manchester\", \"service_times\": {\"saturday\": \"9:00 AM Sabbath School, 11:00 AM Worship\", \"wednesday\": \"7:00 PM Prayer Meeting\"}, \"contact\": \"876-962-2221\"}]}"
    },
    {
        "text": "{\"parish\": \"St. Catherine\", \"churches\": [{\"name\": \"Greater Grace Assembly\", \"address\": \"12 Spanish Town Road, Spanish Town, St. Catherine\", \"service_times\": {\"sunday\": \"9:00 AM & 11:30 AM\", \"wednesday\": \"7:00 PM Prayer Meeting\"}, \"contact\": \"876-984-1234\"}]}"
    },
    {
        "text": "{\"parish\": \"Clarendon\", \"churches\": [{\"name\": \"Clarendon Pentecostal Church\", \"address\": \"45 Church Street, May Pen, Clarendon\", \"service_times\": {\"sunday\": \"8:00 AM & 10:30 AM\", \"wednesday\": \"7:00 PM Prayer Meeting\"}, \"contact\": \"876-983-5678\"}]}"
    },
    {
        "text": "{\"parish\": \"St. Ann\", \"churches\": [{\"name\": \"St. Ann's Bay Baptist Church\", \"address\": \"23 Main Street, St. Ann's Bay, St. Ann\", \"service_times\": {\"sunday\": \"10:00 AM\", \"wednesday\": \"7:00 PM Bible Study\"}, \"contact\": \"876-972-3456\"}]}"
    },
    {
        "text": "{\"parish\": \"Trelawny\", \"churches\": [{\"name\": \"Falmouth Seventh-day Adventist Church\", \"address\": \"15 Market Street, Falmouth, Trelawny\", \"service_times\": {\"saturday\": \"9:00 AM Sabbath School, 11:00 AM Worship\", \"wednesday\": \"7:00 PM Prayer Meeting\"}, \"contact\": \"876-955-7890\"}]}"
    },
    {
        "text": "{\"parish\": \"Westmoreland\", \"churches\": [{\"name\": \"Savanna-la-Mar Methodist Church\", \"address\": \"10 Church Street, Savanna-la-Mar, Westmoreland\", \"service_times\": {\"sunday\": \"9:00 AM & 11:00 AM\", \"wednesday\": \"6:30 PM Prayer Meeting\"}, \"contact\": \"876-937-6543\"}]}"
    },
    {
        "text": "{\"parish\": \"Kingston\", \"professionals\": [{\"name\": \"Dr. Patrice White\", \"type\": \"Psychologist\", \"address\": \"Liguanea, Kingston 6, Jamaica\", \"contact\": \"876-555-1022\"}, {\"name\": \"Dr. Tonya Haynes\", \"type\": \"Clinical Psychologist\", \"address\": \"20 Waterloo Road, Kingston 10\", \"contact\": \"876-555-3384\"}, {\"name\": \"Rev. Michael Harvey\", \"type\": \"Counsellor / Pastor\", \"address\": \"Pentecostal Tabernacle, Kingston\", \"contact\": \"876-922-6977\"}]}"
    },
    {
        "text": "{\"parish\": \"St. Andrew\", \"professionals\": [{\"name\": \"Dr. Kai Morgan\", \"type\": \"Clinical Psychologist\", \"address\": \"Kingston 8, St. Andrew\", \"contact\": \"876-555-4123\"}, {\"name\": \"Grace Counselling Centre\", \"type\": \"Faith-Based Counselling\", \"address\": \"Constant Spring Road, St. Andrew\", \"contact\": \"876-555-8292\"}]}"
    },
    {
        "text": "{\"parish\": \"St. James\", \"professionals\": [{\"name\": \"Dr. Alicia Smith\", \"type\": \"Psychologist\", \"address\": \"Montego Bay, St. James\", \"contact\": \"876-555-7462\"}]}"
    },
    {
        "text": "{\"parish\": \"Manchester\", \"professionals\": [{\"name\": \"Healing Hope Psychological Services\", \"type\": \"Counsellor / Therapist\", \"address\": \"Caledonia Road, Mandeville, Manchester\", \"contact\": \"876-555-3218\"}]}"
    },
    {
        "text": "Mental Health & Suicide Prevention Helpline Helpline  888-NEW-LIFE (888-639-5433)"
    },
    {
        "text": "U-Matter Youth Mental Health Chatline Helpline  876-838-4897"
    },
    {
        "text": "Emergency Services Helpline  119"
    }
]