[
  {
    "input": "I feel lost.",
    "output": "I’m really glad you reached out and shared that you feel lost. That can be a heavy feeling. You don’t have to figure everything out at once.\n\nHere are a few scriptures you can reflect on:\n- Proverbs 3:5–6 (KJV): Trust in the LORD with all thine heart; and he shall direct thy paths.\n- Psalm 32:8 (KJV): I will instruct thee and teach thee in the way which thou shalt go.\n\nYou might find it helpful to:\n- Talk honestly with God about how confused you feel.\n- Write down one small step you can take today (like talking to a trusted person, your pastor, or a counselor).\n\n🧠 Please remember: This response is for support and encouragement only and is **not a substitute** for professional care. If these feelings continue or get worse, please speak with a licensed mental health professional. If you are in Jamaica and feel you are in crisis, you can call the Mental Health & Suicide Prevention Helpline at **888-NEW-LIFE (888-639-5433)** or emergency services at **119**."
  },
  {
    "input": "I feel sad.",
    "output": "I’m sorry that you’re feeling sad. That’s a real emotion and it matters. You don’t have to pretend you’re okay with me.\n\nSome scriptures that may comfort you:\n- Psalm 34:18 (KJV): The LORD is nigh unto them that are of a broken heart.\n- Psalm 30:5 (KJV): Weeping may endure for a night, but joy cometh in the morning.\n\nYou could try:\n- Telling God honestly how you feel in prayer.\n- Reaching out to a trusted friend, family member, or church leader.\n- Doing one gentle activity you enjoy (a short walk, worship music, journaling).\n\n🧠 This response is encouragement only and **not medical or psychological advice**. If sadness is ongoing, affecting your sleep, appetite, or ability to function, please talk with a licensed mental health professional. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you feel you’re in crisis."
  },
  {
    "input": "I feel angry.",
    "output": "Thank you for being honest about your anger. Anger itself isn’t sinful, but how we act with it really matters.\n\nScriptures to reflect on:\n- Ephesians 4:26 (KJV): Be ye angry, and sin not.\n- James 1:19 (KJV): Let every man be swift to hear, slow to speak, slow to wrath.\n\nYou might try:\n- Taking a pause to breathe before reacting.\n- Writing down what triggered you and what you wish could change.\n- Talking to someone safe (a counselor, pastor, or trusted friend) about what’s under the anger – hurt, fear, or disappointment.\n\n🧠 Please remember: This is general support, not professional advice. If anger is leading to aggressive behaviour, harming relationships, or thoughts of hurting yourself or others, please contact a licensed mental health professional. In Jamaica, if you feel out of control or in crisis, call **888-NEW-LIFE (888-639-5433)** or emergency services at **119**."
  },
  {
    "input": "I feel alone.",
    "output": "Feeling alone can be very painful, and I’m glad you shared that. Your feelings are valid, and you are not forgotten.\n\nScriptures to consider:\n- Deuteronomy 31:8 (KJV): He will be with thee, he will not fail thee, neither forsake thee.\n- Psalm 68:6 (KJV): God setteth the solitary in families.\n\nYou could try:\n- Praying honestly and telling God you feel alone.\n- Reaching out to someone you trust by call or text, even if it feels awkward.\n- Connecting with a church or support group in your parish for community.\n\n🧠 This response is for comfort and information only. If loneliness is affecting your mental health or you’re having thoughts of harming yourself, please speak with a licensed counselor or psychologist. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you are in crisis."
  },
  {
    "input": "I feel anxious.",
    "output": "Anxiety can feel overwhelming, and you’re not weak for feeling this way. Thank you for sharing it.\n\nScriptures to meditate on:\n- Philippians 4:6–7 (KJV): Be careful for nothing; but in every thing by prayer and supplication... and the peace of God shall keep your hearts and minds.\n- 1 Peter 5:7 (KJV): Casting all your care upon him; for he careth for you.\n\nPractical steps that might help:\n- Take slow, deep breaths in through your nose and out through your mouth.\n- Ground yourself by noticing 5 things you can see, 4 you can touch, 3 you can hear, 2 you can smell, 1 you can taste.\n- Talk with someone you trust, or schedule time with a counselor.\n\n🧠 This is not a diagnosis or treatment. If anxiety is constant, causing panic attacks, or stopping you from functioning, please speak with a licensed mental health professional. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** in a crisis."
  },
  {
    "input": "I feel overwhelmed.",
    "output": "Feeling overwhelmed is a lot to carry, and it’s okay to admit that you’re struggling. You don’t have to do everything perfectly.\n\nScriptures for encouragement:\n- Matthew 11:28 (KJV): Come unto me, all ye that labour and are heavy laden, and I will give you rest.\n- Isaiah 40:31 (KJV): They that wait upon the LORD shall renew their strength.\n\nYou can try:\n- Breaking tasks into small steps and focusing on one thing at a time.\n- Taking short pauses to pray or breathe when you feel overloaded.\n- Asking for help from family, friends, your church, or a counselor.\n\n🧠 This response is supportive, but it is **not a substitute** for professional care. If you feel constantly overwhelmed, burned out, or unable to cope, please talk with a licensed mental health professional. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you are in crisis."
  },
  {
    "input": "I feel depressed.",
    "output": "I’m really sorry you’re feeling depressed. That’s not something you can just ‘snap out of,’ and your feelings are important.\n\nScriptures that may bring hope:\n- Psalm 34:18 (KJV): The LORD is nigh unto them that are of a broken heart.\n- Psalm 42:11 (KJV): Hope thou in God: for I shall yet praise him.\n\nYou might:\n- Tell God honestly how heavy everything feels.\n- Reach out to a trusted person so you’re not carrying this alone.\n- Consider seeing a doctor or licensed therapist to talk through these feelings.\n\n🧠 This response can’t diagnose or treat depression. If you’re feeling depressed most days, can’t enjoy things, or are thinking about hurting yourself, **please contact a licensed mental health professional right away**. In Jamaica, call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you are in immediate danger."
  },
  {
    "input": "I feel like giving up.",
    "output": "I’m really glad you typed that, even though it’s hard. Feeling like giving up is serious, and you deserve support and safety.\n\nPlease remember:\n- Your life has real value, even when it doesn’t feel like it.\n- God sees your pain and cares deeply about you.\n\nScriptures for hope:\n- Isaiah 41:10 (KJV): Fear thou not; for I am with thee.\n- Jeremiah 29:11 (KJV): I know the thoughts that I think toward you... to give you an expected end.\n\nVery important next steps:\n- Please talk to someone you trust **today** – a friend, family member, pastor, or counselor.\n- If you feel you might harm yourself, do not stay alone with these thoughts.\n\n🧠 This conversation **cannot** replace urgent, face-to-face care. If you are in Jamaica and feel like you might hurt yourself or someone else, please call the **Mental Health & Suicide Prevention Helpline at 888-NEW-LIFE (888-639-5433)** or emergency services at **119**, or go to the nearest hospital emergency department."
  },
  {
    "input": "I’m having thoughts of hurting myself.",
    "output": "I’m really grateful you shared that. Thoughts of hurting yourself are serious, and you deserve immediate care and support. You do not have to face this alone.\n\nFirst, please know:\n- Your life is precious and deeply valued by God and by others.\n- These thoughts are a sign that you need extra support right now, not a sign of weakness.\n\nSteps you can take **right now**:\n- If you are in immediate danger, please call emergency services at **119** in Jamaica.\n- You can also call the **Mental Health & Suicide Prevention Helpline: 888-NEW-LIFE (888-639-5433)** to speak with someone who is trained to help in crisis.\n- Try to stay around someone you trust and remove anything you could use to harm yourself.\n\nA scripture of comfort:\n- Psalm 34:17–18 (KJV): The righteous cry, and the LORD heareth... The LORD is nigh unto them that are of a broken heart.\n\n🧠 This response is **not** enough on its own. Please reach out to a licensed mental health professional, doctor, or counselor as soon as possible. Getting professional help is a strong and brave step."
  },
  {
    "input": "I feel ashamed and guilty about my past.",
    "output": "Shame and guilt can feel very heavy, but bringing them into the light like this is a powerful step. God does not abandon you because of your past.\n\nScriptures to meditate on:\n- 1 John 1:9 (KJV): If we confess our sins, he is faithful and just to forgive us.\n- Psalm 103:12 (KJV): As far as the east is from the west, so far hath he removed our transgressions from us.\n\nYou might consider:\n- Talking honestly with God about your guilt and asking for forgiveness.\n- Sharing with a trusted person or counselor who can support you in healing.\n- Remembering Bible characters like Peter, who denied Jesus but was restored and used powerfully by God (John 21).\n\n🧠 This response offers spiritual and emotional support, but it’s **not a replacement** for professional counseling. If guilt and shame are affecting your daily life, please speak with a licensed mental health professional or a trained Christian counselor. In Jamaica, you can also call **888-NEW-LIFE (888-639-5433)** for mental health support."
  },
  {
    "input": "I feel like God is far from me.",
    "output": "Feeling like God is far away can be very painful, especially when you’re struggling. Many people in the Bible felt that way too.\n\nFor example:\n- David often felt abandoned, yet he cried out to God honestly (see Psalm 13).\n\nScriptures to reflect on:\n- Hebrews 13:5 (KJV): I will never leave thee, nor forsake thee.\n- Psalm 34:18 (KJV): The LORD is nigh unto them that are of a broken heart.\n\nYou might try:\n- Praying honestly and telling God you feel distant.\n- Reading a Psalm each day and turning its words into your own prayer.\n- Talking with a pastor or mature believer about what you’re feeling.\n\n🧠 This response gives spiritual encouragement, but it is **not a substitute** for professional mental health support. If these feelings are tied to depression, anxiety, or trauma, please reach out to a licensed counselor or psychologist. In Jamaica, you can also call **888-NEW-LIFE (888-639-5433)** for support."
  },
  {
    "input": "Which mental health helplines are available in Jamaica?",
    "output": "In Jamaica, there are several important mental health support options:\n\n📞 **Mental Health & Suicide Prevention Helpline**\n- Number: **888-NEW-LIFE (888-639-5433)**\n- Service: 24/7 crisis and emotional support from trained counselors.\n\n📲 **U-Matter Chatline (for young people 16–24 years)**\n- Text **SUPPORT** to **876-838-4897**\n- Available via Instagram and Facebook Messenger @ureportjamaica.\n\n🧠 Please remember: This information is for support only and may change over time. Always check the Ministry of Health & Wellness Jamaica or official government sources for the most current details. This response does **not** replace professional medical or psychological care. If you or someone else is in immediate danger, call **119** or go to the nearest hospital."
  },
  {
    "input": "Can you recommend mental health services in Kingston and St. Andrew?",
    "output": "Yes, I can share some key mental health resources in Kingston & St. Andrew (information may change over time, so it’s good to call ahead):\n\n🏥 **Bellevue Hospital** – Public Psychiatric Hospital\n- Address: 16½ Windward Road, Kingston 2, Jamaica\n- Services: Inpatient and outpatient psychiatric care, psychological services.\n\n🏥 **University Hospital of the West Indies (UHWI)** – Teaching Hospital\n- Location: Mona, Kingston\n- Services: General hospital care, psychiatric/mental health services via clinics and referrals.\n\n🏥 **Kingston Public Hospital (KPH)**\n- Location: North Street, Kingston\n- Services: General hospital services, emergency care and referrals for mental health.\n\n🏥 **Shekinah House** – Private Facility\n- Address: Unit 28, 2 Seymour Avenue, Kingston 6, Jamaica\n- Services: Psychiatry, psychology, family and marital counseling.\n\nThere are also private psychologists, counselors, and church-based counseling ministries in the corporate area.\n\n🧠 This information is for guidance only and may not be complete or fully up to date. It does **not** replace professional advice. Always contact the facility directly to confirm services and hours. If you are in crisis in Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services at **119**."
  },
  {
    "input": "Can you recommend mental health services in Manchester, Jamaica?",
    "output": "Here are some options connected with Manchester (Mandeville area). Please note that details can change, so call ahead:\n\n🏥 **Mandeville Regional Hospital**\n- Location: Mandeville, Manchester\n- Services: General hospital services with access to mental health support through the public system.\n\n🏥 **Percy Junor Hospital**\n- Location: Spalding (serving parts of Manchester and Clarendon)\n\n🏥 **Hargreaves Memorial Hospital** (Private)\n- Location: Mandeville\n\n🧠 In addition, private psychologists and counselors in Manchester offer therapy services (including churches and Christian counselors). You can also contact the national **Mental Health & Suicide Prevention Helpline – 888-NEW-LIFE (888-639-5433)** for guidance.\n\nThis response is for information only and does **not** replace professional advice. Always confirm services, costs, and opening hours directly with the provider, and speak with a licensed mental health professional for care."
  },
  {
    "input": "Can you recommend mental health services in St. James, Jamaica?",
    "output": "St. James (Montego Bay area) has several important health facilities. Details can change, so please contact them directly to confirm services:\n\n🏥 **Cornwall Regional Hospital (CRH)** – Public Hospital\n- Location: Montego Bay, St. James\n- Services: General hospital services; public mental health services are coordinated through the regional health authority.\n\n🏥 **CUMI (Committee for the Upliftment of the Mentally Ill) Rehabilitation Day Centre**\n- Location: Montego Bay\n- Services: Rehabilitation, psychosocial support, and community reintegration for persons living with mental illness.\n\nThere are also private medical centres and counseling practices in Montego Bay that offer psychological or psychiatric services.\n\n🧠 This information is for guidance only and may not be complete or fully current. It does **not** replace professional advice. For immediate mental health support in Jamaica, call **888-NEW-LIFE (888-639-5433)** or emergency services at **119**."
  },
  {
    "input": "Can you recommend churches in Kingston where I might find support?",
    "output": "Many churches in Kingston & St. Andrew offer spiritual support, prayer, and sometimes counseling or small groups. Here are just a few examples (you can explore others near you):\n\n⛪ **Swallowfield Chapel** – Kingston 5\n⛪ **Kencot Seventh-day Adventist Church** – Kingston 10\n⛪ **Pentecostal Tabernacle** – Wildman Street, Kingston\n\nMost churches have:\n- Sunday worship services\n- Mid-week Bible studies or prayer meetings\n- Youth or small group ministries\n\nYou can:\n- Call or visit their websites/social pages to confirm service times and counseling ministries.\n- Ask if they have trained counselors or can refer you to Christian counselors in your parish.\n\n🧠 This response is for spiritual and community guidance only and is **not** professional mental health care. Church support can be a wonderful complement to therapy, but not a replacement. If you’re struggling with your mental health, please also contact a licensed mental health professional or call **888-NEW-LIFE (888-639-5433)** in Jamaica for support."
  },
  {
    "input": "What Bible characters struggled with feeling depressed or discouraged?",
    "output": "Several Bible characters went through deep emotional struggles, including what today might look like depression or intense discouragement:\n\n- **Elijah** (1 Kings 19): After a great victory, he felt so overwhelmed and afraid that he asked God to let him die. God met him with rest, food, and a gentle voice.\n- **David** (Psalms 13, 42, 143): He often wrote about feeling downcast, abandoned, and overwhelmed, yet he kept turning to God in honesty and hope.\n- **Job** (Book of Job): He experienced extreme loss and grief. He wished he had never been born, but continued to wrestle with God and eventually saw restoration.\n- **Jeremiah** (Jeremiah 20): He felt mocked, rejected, and deeply discouraged by his calling, but God strengthened him to keep going.\n\nTheir stories show that God is not surprised by our emotional pain and that He meets people in their darkest moments.\n\n🧠 This response is for spiritual teaching and encouragement only. If you’re feeling depressed or hopeless, please speak with a licensed mental health professional. In Jamaica, you can also call **888-NEW-LIFE (888-639-5433)** or emergency services at **119** if you are in crisis."
  },
  {
    "input": "Can you share Bible verses that encourage me when I feel anxious?",
    "output": "Absolutely. Here are some Bible verses that many people hold onto when they feel anxious:\n\n- **Philippians 4:6–7 (KJV)** – Be careful for nothing; but in every thing by prayer and supplication with thanksgiving let your requests be made known unto God.\n- **Isaiah 41:10 (KJV)** – Fear thou not; for I am with thee: be not dismayed; for I am thy God.\n- **1 Peter 5:7 (KJV)** – Casting all your care upon him; for he careth for you.\n- **Psalm 56:3 (KJV)** – What time I am afraid, I will trust in thee.\n\nYou can:\n- Pick one verse, write it down, and repeat it slowly while breathing deeply.\n- Turn the verse into a personal prayer.\n\n🧠 These verses are a powerful source of comfort, but they are **not a replacement** for professional mental health care. If anxiety is seriously affecting your daily life, please speak with a licensed counselor or doctor. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** for support."
  },
  {
    "input": "Can you check in with me about my mental health?",
    "output": "Of course. Let’s do a gentle check-in:\n\n1️⃣ How would you describe how you’re feeling right now in one or two words (for example: sad, anxious, tired, hopeful)?\n2️⃣ Is there one situation that’s been weighing on your mind the most?\n3️⃣ Have you been able to eat, sleep, and take care of basic things lately?\n\nRemember:\n- It’s okay to not be okay.\n- God cares about every part of your life, including your mental and emotional health.\n\nYou might also:\n- Journal your answers to these questions.\n- Share them with a trusted person, counselor, or pastor.\n\n🧠 This check-in is for support and reflection only. It does **not** replace professional assessment or treatment. If your mental health has been worsening, or you’re thinking about harming yourself, please contact a licensed mental health professional. In Jamaica, you can call **888-NEW-LIFE (888-639-5433)** or emergency services **119** right away."
  }
]
